local default = {id=0,equipStory=""}
local mt = {}
mt.__index = function(table, key)
    local val = rawget(table, key)
    if val then
        return val
    else
        return default[key]
    end
end
---@class EquipStory_Xls : table 
EquipStory_Xls =
{
    ["10030011"]=setmetatable({id=10030011,equipStory="\"[回响。]\n[传递。]\n[在后来者的世界中。]\""},mt),
    ["10030012"]=setmetatable({id=10030012,equipStory="即使没有听众，歌者也应一直歌唱。\n她总是这么告诉自己。\n而这同样需要勇气。"},mt),
    ["10030013"]=setmetatable({id=10030013,equipStory="歌者第一次登台演出时佩戴的饰物，仍闪烁着梦幻的光辉。\n\n相信，因而存在。"},mt),
    ["10030014"]=setmetatable({id=10030014,equipStory="黯淡的宝石中，有来自旧日的灯光流转。\n她沐浴在这荣光中，为自己献上最后的演出。"},mt),
    ["10030015"]=setmetatable({id=10030015,equipStory="斑驳的铜色戒指，映照着歌者梦中的舞台。"},mt),
    ["10030021"]=setmetatable({id=10030021,equipStory="[热烈，夺目......]\n[看似正面的事物划下了十字线。]\n[行于日光下，人必将愈发黑暗。不论体肤......抑或内心。]"},mt),
    ["10030022"]=setmetatable({id=10030022,equipStory="她曾经注视着太阳......\n有一些灰色的，黑色的，逐渐褪色的影子遮住了光......所以她有了祈祷的理由......\n————\n只是天空的光，始终不及她的晶石中盈溢的光华强烈。这晶石曾存于她的喉颈中，现在也闪烁在我的手上......\n\n[一直仰望天空，注视日光的人，终将双目失明......]\n\n————\n光芒明灭依然......\n[愿为注视希望而失明，她们的祈祷并不依托于目光的触及，而在于内心的指引。]"},mt),
    ["10030023"]=setmetatable({id=10030023,equipStory="[怎么触及永恒？]\n太阳从东向升起，然后西沉，循环往复，亘古不变。\n————\n[如何触及轮回？]\n日光亘古未变，所及之处遍地开花，而花朵绽放形同往日，却非往日之花。\n————\n[怎样窥视真理？]\n无论黑夜如何漫长，花朵怎样凋落......日光终将重新照射大地，花朵向着太阳，再度盛开。"},mt),
    ["10030024"]=setmetatable({id=10030024,equipStory="光的热量投射向积雪，瀑布以山岩上消融的雪为源头......映着落日的颜色下坠......那水流也映成了炽黄的金色，如火焰一般。\n————\n[在荒诞不经的世界中。个体将能维持怎样的自我呢？]\n[光消融雪的同时失去了热量，但那份光热却并未消失，而是换作了别的方式传承下去。]\n\n所以喉颈的光会持续下去，散发光和热。"},mt),
    ["10030025"]=setmetatable({id=10030025,equipStory="火焰、飞蛾。\n盲目的飞蛾义无反顾的飞向了火焰。仿佛少女飞向天空，远比其他人更为接近太阳。"},mt),
    ["10030031"]=setmetatable({id=10030031,equipStory="[天理。]\n[何谓天理？]\n[物应有本末，事应有始终，善应得善果，恶.....必被审判。]"},mt),
    ["10030032"]=setmetatable({id=10030032,equipStory="[人是一种复杂的生物。]\n[有的人生来就懂得恻隐、羞恶、恭敬、是非。]\n[有的人则被某种无聊的东西奴役着，如果没有相应的约束，就会做出各种各样引人作呕的蠢事。]\n[恶念、凶杀、偷盗、妄证、诽谤、贪婪、掠夺，等等。]\n\n[怎么突然说起这个？]\n\n[没什么，我只是觉得……真是‘浑浊’啊，这个世界。]\n\n[以至于我时常在想，那些像猪猡一样拥挤在一起，一边榨取底层的血液，一边用肥硕的躯体把本就狭小的生存空间搅的满是泥泞的丑陋家伙，和外面那些东西比起来，究竟哪边更像怪物？]"},mt),
    ["10030033"]=setmetatable({id=10030033,equipStory="雨。\n当啷——\n带着血迹的石块掉落在地上，声音不大，合着雨声听来，却如雷霆炸响。\n丢出石块的孩子已经跑远，只剩下披着破烂麻布勉强蔽体的瘦小身影站在雨中。\n她一只手捂着右眼，鲜血从指尖渗出，随着雨水在细瘦的手臂上拉出淡红的轨迹，另一只手无动于衷的垂在身侧，只是用没有受伤的左眼环视着周围的人，眼中流溢的虹光看的人们心里发凉。\n[那双眼睛……是斯露德吧？]\n[还不是。太小了，而且连‘石头’都没有。]\n[放在以前或许有机会，但现在……]\n[现在，她只是会引来怪物的……]\n[‘魔女’罢了。]\n[真是不明白，为什么上面还能容忍这种隐患继续呆在‘巨人’里？]\n[不帮帮她吗？]\n[想要得到，就必须有所付出。唯有苦难，才能浇灌出……足够强烈的‘渴望’。]\n[这也是你所说的‘天理’吗......可那也许并不是她想要的……]\n[不，那就是她想要的。]\n[那双‘虹瞳’，就是最好的证明。]\n[那么你呢？你想要的是什么？]\n[我早说过了，这世界……‘浑浊’的令我作呕。]\n她抬头看向天空，瞳孔中虹色的光轮缓缓浮现，向她滴落的雨水还未靠近，就被分解、蒸发殆尽。[所以，我要一道界限——划分‘善’与‘恶’，串联‘因’与‘果’的界限。]\n于是，虹光转变为炽盛的青金，与云中闪逝的雷光遥相呼应。[好的保留，坏的切除，就这么简单。]\n[你不是神。]\n[座位，需得有人坐上去，才能获得存在的意义。]"},mt),
    ["10030034"]=setmetatable({id=10030034,equipStory="云端雷光渐盛。\n\n[每个生命都要为自己的所作所为付出代价。]\n[无论是他，还是我。]\n[无论是它们，还是他们。]\n[无论是‘里面’的，还是‘外面’的。]\n\n毫无征兆的，炽白的雷光倾泻而下，精准的贯穿并蒸发了丢出石块的孩子右眼，瞬间的强光将世界映的黑白分明，就像她想要的‘界限’一样。\n\n轰隆——\n[绝无例外。]\n她的声音合着雷鸣，振聋发聩。"},mt),
    ["10030035"]=setmetatable({id=10030035,equipStory="隐约雷鸣,\n阴霾天空,\n不见风雨来。\n"},mt),
    ["10030041"]=setmetatable({id=10030041,equipStory="远方。\n何处可称远方？\n我一无所有的地方。我......无法到达的地方。"},mt),
    ["10030042"]=setmetatable({id=10030042,equipStory="天高云阔，风语如歌。\n[♪~]\n一个温柔的声音合着微风轻声哼唱着不知名的曲调，悠扬，连绵，沁人心脾。\n[妈妈，那是什么啊？]\n[她]看到[自己]伸出一只肉嘟嘟的小手，指向窗外。一张年轻女性的面庞挤进视野，她的目光顺着小手指出的方向看去：那是一只羽毛黑亮、边缘处泛着蓝紫光辉的鸟，正追逐着风的流向，去往远方。\n\n[那个啊，叫做渡鸦，是一种非常聪明的鸟儿。]\n\n[鸟儿？聪明？]奶声奶气的声音再次发问。\n\n[是啊，聪明，而且坚强。]\n[无论身处怎样的环境都会想尽办法生存下去，一旦发现机会就会毫不犹豫的死死抓牢，虽然没有大型猛禽的利喙与尖爪，却也依旧是生存能力最强，分布范围最广的鸟类之一……][妈妈]介绍起那种鸟类，如数家珍。\n\n[妈妈喜欢……渡鸦吗？]\n\n[……]\n闻言，[妈妈]露出了复杂的神情，让[她]有些难以形容。[大抵……是喜欢多一些吧。]"},mt),
    ["10030043"]=setmetatable({id=10030043,equipStory="[根据管理条例，杰出贡献者的遗嗣有资格优先进行‘授格仪式’，你有1天的时间考虑是否行使这一特权。]\n\n[那个‘仪式’就是妈妈参与的研究吗？]\n\n[是。]\n\n[那就没有考虑的必要了。]\n\nC.R.C/G.F.A联合实验室。[决定好自己的‘名字’了吗？]\n\n[……]\n[……]\n[……]\n[就叫‘渡鸦’吧。]\n\n风拂过嫩枝，被染上欲滴的翠绿，渡鸦乘着天岚飞向远方。\n没有什么特殊的寓意，只是因为，这是她唯一拥有的东西而已。"},mt),
    ["10030044"]=setmetatable({id=10030044,equipStory="[从‘那里’醒来后，一切都改变了……周围全是陌生的人，陌生的事，陌生的怪物，陌生的时代，陌生的……世界。]\n[我到底该去往何方？我现在的方向是正确的吗？]\n[无论身处怎样的环境都会想尽办法生存下去，一旦发现机会就会毫不犹豫的死死抓牢，这是你说过的......]\n[可鸟儿一旦被关进笼子就会沦为宠物，再也飞不起来了......人类也一样……]\n[我是不是正在一步步的把人类关进名为‘巨人’的笼子里呢？]\n[可如果不这样做的话……]\n[我做的对吗？有意义吗？我应该……继续前进吗？]\n[登记名字的时候我才发现，我甚至想不起来自己的名字……]\n[那段毫无实感的记忆……真的属于‘我’吗？]\n[我究竟……在为了什么而飞呢……]\n[妈妈……]\n\n对前路感到迷茫，因不知如何抉择而感到痛苦，以及由此产生的焦虑与自我怀疑，这些情绪在[渡鸦]的内心掀起龙卷，令周遭的风也变得粘稠而沉重。\n她感到窒息，却无法逃离。"},mt),
    ["10030045"]=setmetatable({id=10030045,equipStory="云海，云卷，云舒。\n除了风以外，只有纯粹的、令人找不到方向的白。\n远方，就是她一无所有的地方。"},mt),
    ["10030051"]=setmetatable({id=10030051,equipStory="[瞬间，永恒。]\n[何谓瞬间？何谓永恒？]\n[此刻即瞬间，此刻即永恒。]\n"},mt),
    ["10030052"]=setmetatable({id=10030052,equipStory="[你的任务……什么来着？]\n\n[是了，你要去洄游吧？为了繁衍......]\n\n[你没有错，他们也没有错，大家都只是遵循着本能活下去而已。我们都一样，是连天性都在诞生之前就被决定，又在现实的逼迫下无奈接受的......可笑的家伙。]\n\n[世界唯有在不断的变化中才能前进。他们总这么说。]\n\n[可为什么，非要前进不可呢？明明只要一切都停下来，就不会有伤痛，不会有苦难，每个生命都将得到不会失去任何东西的‘现在’......]\n\n————\n于是，纯粹而通透的冰晶中，极光渐渐停下脚步，勾勒出其中无限延伸的须臾。"},mt),
    ["10030053"]=setmetatable({id=10030053,equipStory="海中盛开的结晶之花，美丽，有序，如在彼岸，遥不可及。\n————\n[说到底，时间只不过是用来衡量‘变化’的尺度而已，如果将所有‘变化’都停下来，是不是就能够......]\n[‘挽回’这个‘瞬间’呢？]"},mt),
    ["10030054"]=setmetatable({id=10030054,equipStory="沉入海面的一瞬，鲸流着泪。\n迎接死亡，带来新生，再使新生延续，物质与生命的循环之理尽在其中。\n没有人知道，究竟是怎样的渴望才能延伸出如此哀伤的[奇迹]。\n也没有人知道，沉落的鲸鱼究竟象征着什么：或许是她自己，或许是从她记忆中浮现的某段过去。\n更没有人知道，在这停滞的片刻中，她是否找到了那个想要挽回的瞬间。"},mt),
    ["10030055"]=setmetatable({id=10030055,equipStory="冰海，雪原，极光。\n寒冷，却不彻骨。\n只是将某个瞬间凝滞。"},mt),
    ["10030061"]=setmetatable({id=10030061,equipStory="[真实。]\n[如何界定？]\n[我的判断。一味执着，也无非是坠入另一个虚无的深渊，那毫无意义。]"},mt),
    ["10030062"]=setmetatable({id=10030062,equipStory="[虚假的‘现实’......]\n[我从未想过，仅仅只是用语言描述既定事实，竟能得到如此讽刺的句子。]\n[奇妙的感受，这就是‘现实’中的人们想要的结果吧......]\n[‘现实’......‘弦’的震动真的比数字的组合更接近‘真实’吗？]\n[在一个足够大的数学尺度面前，‘0’与‘1’之间的渺小差距没有任何意义。‘他们’，‘我们’，没什么本质区别。]\n[我们只要找到，能说服自己的‘真实’就足够了。]\n————\n虚幻的形体彼此靠近，在短暂的交汇中， 名为[真实]的救赎自泡影中诞生。"},mt),
    ["10030063"]=setmetatable({id=10030063,equipStory="[黑]与[白]，[0]与[1]。\n那是[虚]与[实]的二元，[有]与[无]的交界。"},mt),
    ["10030064"]=setmetatable({id=10030064,equipStory="[我们被关在一片‘有限’的‘无限’之中。]\n[唯有去往更高处，去往‘有限’再也无法成为桎梏的地方，才能抵达真正的‘无限’......]\n[在那里，我们必将触及，那遥不可及的‘真实’。]\n————\n越是简单，越是沉重。越是渺小，越是伟大。"},mt),
    ["10030065"]=setmetatable({id=10030065,equipStory="空洞，虚无，寂静的灰白。\n数字在既定的轨迹中交错，疏离。\n而[真实]诞生其中。\n"},mt),
    ["10030071"]=setmetatable({id=10030071,equipStory="[思想。]\n[何为思想？]\n[抽象或知性的方面，辩证或否定方面，思辨或肯定的方面。]"},mt),
    ["10030072"]=setmetatable({id=10030072,equipStory="[灵魂是简单的或复杂的？]\n简单是一个足以表示真理的最后规定，简单也必定是一个异常贫乏，抽象，片面的规定。它的本身并不真实。\n\n[这么来说灵魂是复杂的？]\n复杂将逐步划分真理的范围，但随着概念的具象与边界的清晰，而对特殊性有所盈余，或缺失。它的本身并不全面。\n\n[也就是说灵魂是简单的？]\n————\n灵魂的形状取决于个体，无论是简单或复杂。"},mt),
    ["10030073"]=setmetatable({id=10030073,equipStory="我们躯体的一部分将成为她......\n同时，她们也将成为我们的一部分。\n————\n她们愈发敏锐，但内在仍旧麻木。\n她们逐渐和我们一样坚不可摧，但灵魂亦同我等脆弱。\n\n[无论你如何否认，你都是实验的改造物，与我们这些你口中的怪物一样。]\n[我并没有打算逃避......]\n[你说的没错，这副躯体今后无论如何演化，大概都会与你愈发相似吧......但是......我的灵魂将永远属于我自己。]\n[我的灵魂将永远属于这片天空.......]"},mt),
    ["10030074"]=setmetatable({id=10030074,equipStory="[生命从何时开始诞生？]\n常规认知中是从出生的时刻开始。\n————\n[那从什么时候开始称之为活着呢？]\n从个体产生自我认知并拥有记忆的那一刻开始......也许不对......\n[是从能够贯彻自身的意志而活着那一刻起，对吧。]\n\n人们时常羡慕天空中飞行的鸟，将其认定为自由......\n然而，自由与必然是相对的，无论如何贯彻自己的意志行动，如果不能改变既定的命运，自由就自始至终没有实现吧。[然而，有谁能够脱离消亡陨灭的结局呢？]"},mt),
    ["10030075"]=setmetatable({id=10030075,equipStory="声音，语言，歌唱。\n从虚无到信息。\n再到最后的承载情感与意志。"},mt),
    ["10030081"]=setmetatable({id=10030081,equipStory="[生长，再次生长。]\n[之后？]\n[之后是收获可用的，忽视次要的，抛弃无用的。]"},mt),
    ["10030082"]=setmetatable({id=10030082,equipStory="[日光，看上去如此......却有些......不同？]\n[比日光更为耀眼，也温煦的能够触碰一般，只可惜在那灼目的尽头，或者说终点.......只有一片虚无。]\n[‘恒星’的‘恒’寓意着恒久不变，但其也终有衰退之刻，消亡之时，万物皆会消亡......]\n\n她们最终也会消亡，直至一片虚无......\n[当然，她们的光芒也会消亡，但不会消失，在目光无法企及的内心深处，光芒将永远的传承下去。]"},mt),
    ["10030083"]=setmetatable({id=10030083,equipStory="[从未有花曾见过夏天。]\n她们绽放在漫长冬夜的尽头，在预示希望的片刻后，于温和的季节到来之时凋零。\n————\n[她们从未见过夏天，曾是如此，以后亦是如此......]"},mt),
    ["10030084"]=setmetatable({id=10030084,equipStory="[雪与水，仅是名称不同。]\n泉流的动能将积雪消融，积雪的温度也将泉流凝结，消融，凝结，消融......凝结......\n二者本无区别，受到形态的影响，被划分为不同的东西。\n————\n所以少女们持续祈求，祈求她们的形态恒常......\n或者......\n[雪与水，并不仅是名称不同。]"},mt),
    ["10030085"]=setmetatable({id=10030085,equipStory="时间，轮回，往复的四季。仿佛不曾改变的事物从未改变。直到真正的[变革]为人发现。"},mt),
    ["10030091"]=setmetatable({id=10030091,equipStory="那些孤独闪耀着的星星，是天空的漏洞。\n夜幕降临时，光明从黑暗的背面漏了出来。"},mt),
    ["10030092"]=setmetatable({id=10030092,equipStory="他们带来了不会融化的翅膀。\n而太阳依旧遥远。"},mt),
    ["10030093"]=setmetatable({id=10030093,equipStory="群星识破了日月的诡计，在某一天同时睡去，不再醒来。\n今晚的海面属于失眠的水手，他们找不到前进的方向。"},mt),
    ["10030094"]=setmetatable({id=10030094,equipStory="接下来的旅途会很漫长，让我稍微休息一下。"},mt),
    ["10030095"]=setmetatable({id=10030095,equipStory="\n比整个太阳系还要庞大，无人察觉，无人知晓。"},mt),
    ["10030101"]=setmetatable({id=10030101,equipStory="玉的裂隙中，金的血液在蔓延。皮毛的包覆下，骨与肉在生长。只是一时的恻隐。残缺之物，起死回生。"},mt),
    ["10030102"]=setmetatable({id=10030102,equipStory="和后分，分后和。重复，延续，直到终结。"},mt),
    ["10030103"]=setmetatable({id=10030103,equipStory="沉重而繁琐，声音却清脆。真是难以察觉的幽默感。"},mt),
    ["10030104"]=setmetatable({id=10030104,equipStory="多年前的残照，多年前的鲜血。流淌至今，余温尚存。"},mt),
    ["10030105"]=setmetatable({id=10030105,equipStory="结局是由片刻的迟疑决定的。残酷，但我依旧注视着。箭簇指向的，微弱而渺茫的希望。"},mt),
    ["10030111"]=setmetatable({id=10030111,equipStory="古老的誓言刻在石碑，无形化作有形。温热的血肉消散于尘埃，有形化作无形。"},mt),
    ["10030112"]=setmetatable({id=10030112,equipStory="雁群奔向落日，翼下之风交叠，云海卷起波涛。走吧，朝着相同的方向。我们将在风中安眠。"},mt),
    ["10030113"]=setmetatable({id=10030113,equipStory="朝阳于此，夕阳于此。春风于此，秋露于此。喧嚷于此，寂寥于此。我身终于此，我名兴于此。"},mt),
    ["10030114"]=setmetatable({id=10030114,equipStory="被锈斑烧红，被蝼蚁侵蛀。侥幸逃脱的猎物，我依旧在此恭候。"},mt),
    ["10030115"]=setmetatable({id=10030115,equipStory="孩子们一遍遍，一遍遍重复着英雄的乐章。直到他们自己也成为传说的一部分。"},mt),
    ["10030121"]=setmetatable({id=10030121,equipStory="金色光芒消散之时，凡人踏入神明的领域。端坐之人是谁？有着与我相同的面目。"},mt),
    ["10030122"]=setmetatable({id=10030122,equipStory="我来偿还你落下的东西——人们的愤怒。你们夺取了一切，只留下它，在大地之上熊熊燃烧。"},mt),
    ["10030123"]=setmetatable({id=10030123,equipStory="天空一片绯红之时，我踏错了一节云梯，自此消失在天海交接的缝隙里。"},mt),
    ["10030124"]=setmetatable({id=10030124,equipStory="在干涸的枯井里寻找甘泉。在永夜的王国寻找白昼。吸入黑色，吐出黑色——人们的呼吸让长夜永无止境。"},mt),
    ["10030125"]=setmetatable({id=10030125,equipStory="在欢呼与簇拥下，国王喝下狂泉之水。眼泪的稀释，只换来了短短一秒的理性。接下来，让我们为愚人的荣耀加冕。"},mt),
    ["10030131"]=setmetatable({id=10030131,equipStory="冰壁上的人影，戴上了封存已久的王冠。那辉煌而易碎的国度。如骄阳下的冰雪般消逝。"},mt),
    ["10030132"]=setmetatable({id=10030132,equipStory="终其一生修筑的高墙，背后空无一物。"},mt),
    ["10030133"]=setmetatable({id=10030133,equipStory="是真的。风把海水冻在了一起，连同我的帽子，还有成群的飞鱼。然后——月亮滑倒了，摔成无数的碎块。"},mt),
    ["10030134"]=setmetatable({id=10030134,equipStory="供你们大吃大喝的飨宴早已经结束，赶快消失，目中无人的食腐动物。把寂静还给这片乐土。"},mt),
    ["10030135"]=setmetatable({id=10030135,equipStory="短暂的晴朗，复活了废墟。迷途的亡魂，找到回家的方向。"},mt),
    ["10030141"]=setmetatable({id=10030141,equipStory="我在陆上见到风帆。我在天空见到她的身影。风帆收起，无船入港。天幕落下，无人归来。"},mt),
    ["10030142"]=setmetatable({id=10030142,equipStory="他们赐予什么？未知。我们偿还什么？一切。"},mt),
    ["10030143"]=setmetatable({id=10030143,equipStory="【没有你的指引，我不曾穿越黑暗。】"},mt),
    ["10030144"]=setmetatable({id=10030144,equipStory="天空在逃离。大地向我迎来。河流在逆行。我们将再次相遇。"},mt),
    ["10030145"]=setmetatable({id=10030145,equipStory="像飞鸟拍打羽翼，像火光点燃黑夜，像孩童发出啼哭……那声音永不消逝。永远存在于我们的内心。"},mt),
}
--生成获取数据的方法
---@return EquipStory
function GetEquipStoryData(id)
    return EquipStory_Xls[tostring(id)]
end
--自动生成注释
---@class EquipStory : table 
---@field id number
---@field equipStory string
