---@class LeaderBookWand_Xls : table 
LeaderBookWand_Xls =
{
    ["200100102"]={id=200100102,wandName="调停",wandWeight="3.3kg",wandPlace="R-A.t1矿坑",wandFeatures="基于训练使用式杖设计，适用于全能型斯露德",wandMaterial="伴合金",wandRrait="轻质式杖",wandDes="驱动原石在经过与法尼娅的共鸣后呈现天青色，根据法尼娅本人的意见后，对式杖主体的设计更偏向于实用性，因此未增加用于装饰的部分。\n        法尼娅各项测试数据趋于平衡，式杖的样式参考训练用基础式杖为原型进行设计，在此基础上增加了更利于凝聚驱动源能的配置，能够保证源能共鸣强度过强的法尼娅更容易凝聚源能。\n\n",wandText="“现在人类的处境，让我并不敢妄下结论，\n但除开彼此毁灭以外我们或许拥有另一种可能。\n法尼娅，可能性从来都不会是零。\n我并不能改变什么，\n但我觉得你能够做到，\n带领人类走向另一种可能”\n\n揉碎的纸张被塞在了式杖的夹缝里。"},
    ["200200102"]={id=200200102,wandName="裁决",wandWeight="7.6kg",wandPlace="G.T102矿坑",wandFeatures="基于训练使用式杖设计，适用于全能型斯露德",wandMaterial="重金属合金",wandRrait="附魔式杖",wandDes="私人制造制作而成的式杖。\n驱动原石在经过与奈纳的共鸣后呈现黄色，式杖上装饰有私人加工站特殊的记号，式杖的样式和REVO制完全不同，加入了更多制造者自身的喜好，其中一些只是做装饰用，奈纳本人很满意。\n——AA.",wandText="制作这把式杖的人给奈纳讲了一个传说，在古代时期，一个被称为神圣庭的古迹位于这块矿石的开采地，虽然现在已经不能寻到其踪迹。神圣庭为当时被称为<神之使者>的生物掌控，他们拥有浩瀚的智慧指引着人类文明飞速发展，而这些<神之使者>拥有着决定罪恶之人生死的权利，他们给遵从意志之人渊博的知识，给叛逃旨意之人生不如死的境遇，因为审判的严苛，一些被判决为罪恶之人的人们组织起来反抗<神之使者>，神圣庭被摧毁，据说不少<神之使者>也死于这场叛乱。后来那里不知怎么就被尘土掩盖，或许是违背了神的旨意所以遭到了裁决吧。\n“那些还活着的神之使者后来去哪里了？”\n“谁知道呢，不过是个传说罢了，神的使者哪有那么容易被杀死。”\n\n制造人根据这个传说给式杖取名为“裁决”。"},
    ["200300102"]={id=200300102,wandName="虚妄",wandWeight="4.3kg",wandPlace="R-A.t1矿坑",wandFeatures="基于训练使用式杖设计，适用于全能型斯露德",wandMaterial="改良伴合金",wandRrait="坚固式杖",wandDes="夏洛使用源能极其特殊，这种操作方式很少见到，能够极大程度的控制源能汇聚成特殊的形态，这种操作方式往往需要长期的训练才能学会如此精妙地操作方式，当前对于式杖的设计只能尽可能的辅助夏洛完成这种操作。\n——REVO.Y",wandText="夏洛曾经做了一个梦，她梦见自己盛装打扮，站在座无虚席的舞台中央尽情地歌唱，舞台下的人们都在认真地欣赏她的演出，天空之中没有异生体的侵袭，她自由自在地歌唱。\n人们幸福地听着她唱的歌曲，没有咒骂，没有责备，没有恐惧。\n然后夏洛将这个梦讲给了她的妹妹。\n\n“真的会有那样的一天吗？美好的甚至不像是梦境了。”\n“是真的很美好呀！啊！新年愿望我知道了！希望有一天斯露德可以自由地在天空下歌唱！”\n“希望真的会有那么一天吧，虽然现在只是虚妄。”\n“一定会的！”"},
    ["200400102"]={id=200400102,wandName="朱雀",wandWeight="1kg",wandPlace="阿斯加德隐藏矿洞",wandFeatures="基于训练使用式杖设计，适用于全能型斯露德",wandMaterial="艾德曼合金",wandRrait="强攻式杖",wandDes="无",wandText="无"},
    ["200500102"]={id=200500102,wandName="虚临时妄",wandWeight="2.33kg",wandPlace="R-A.t1矿临时坑",wandFeatures="基临时于训练使用式杖设计，适用于全能型斯露德",wandMaterial="改临时良伴合金",wandRrait="坚固临时式杖",wandDes="夏洛临时临时临时使用源临时能极其特殊，这种操作方临时式很少见到，能够极大程度的控制源能汇聚临时成特殊的形态，这种操作方式往往需要长期的训练才能学会如此精妙地操作方式，当前对于式杖的设计只能尽可能的辅临时助夏洛完成这种操作。\n——REVO.Y",wandText="夏洛临时临时临时曾经做了一个梦，她临时梦见自己盛装打扮临时，站在座无虚席的舞台中央尽情地歌唱，舞台下的人们都在认真地欣赏她的演出，天空之中没有异生体的侵袭，她自由自在地歌唱。\n人们幸福地听着她唱的歌曲，没有咒骂，没有责备，没有恐惧。\n然后夏洛将这个梦讲给了她的妹妹临时。\n\n“真的会有那样的一天吗？美好的甚至不像是梦境了。”\n“是真的很美好呀！啊！新年愿望我知道了！希望有一天斯露德可以自由地在天空下歌唱！”\n临时“希望真的会有那么一天吧，虽然现在只是虚妄。”\n“一定会的！”"},
    ["200600102"]={id=200600102,wandName="虚临时妄",wandWeight="2.33kg",wandPlace="R-A.t1矿临时坑",wandFeatures="基临时于训练使用式杖设计，适用于全能型斯露德",wandMaterial="改临时良伴合金",wandRrait="坚固临时式杖",wandDes="夏洛临时临时临时使用源临时能极其特殊，这种操作方临时式很少见到，能够极大程度的控制源能汇聚临时成特殊的形态，这种操作方式往往需要长期的训练才能学会如此精妙地操作方式，当前对于式杖的设计只能尽可能的辅临时助夏洛完成这种操作。\n——REVO.Y",wandText="夏洛临时临时临时曾经做了一个梦，她临时梦见自己盛装打扮临时，站在座无虚席的舞台中央尽情地歌唱，舞台下的人们都在认真地欣赏她的演出，天空之中没有异生体的侵袭，她自由自在地歌唱。\n人们幸福地听着她唱的歌曲，没有咒骂，没有责备，没有恐惧。\n然后夏洛将这个梦讲给了她的妹妹临时。\n\n“真的会有那样的一天吗？美好的甚至不像是梦境了。”\n“是真的很美好呀！啊！新年愿望我知道了！希望有一天斯露德可以自由地在天空下歌唱！”\n临时“希望真的会有那么一天吧，虽然现在只是虚妄。”\n“一定会的！”"},
    ["200700102"]={id=200700102,wandName="虚临时妄",wandWeight="2.33kg",wandPlace="R-A.t1矿临时坑",wandFeatures="基临时于训练使用式杖设计，适用于全能型斯露德",wandMaterial="改临时良伴合金",wandRrait="坚固临时式杖",wandDes="夏洛临时临时临时使用源临时能极其特殊，这种操作方临时式很少见到，能够极大程度的控制源能汇聚临时成特殊的形态，这种操作方式往往需要长期的训练才能学会如此精妙地操作方式，当前对于式杖的设计只能尽可能的辅临时助夏洛完成这种操作。\n——REVO.Y",wandText="夏洛临时临时临时曾经做了一个梦，她临时梦见自己盛装打扮临时，站在座无虚席的舞台中央尽情地歌唱，舞台下的人们都在认真地欣赏她的演出，天空之中没有异生体的侵袭，她自由自在地歌唱。\n人们幸福地听着她唱的歌曲，没有咒骂，没有责备，没有恐惧。\n然后夏洛将这个梦讲给了她的妹妹临时。\n\n“真的会有那样的一天吗？美好的甚至不像是梦境了。”\n“是真的很美好呀！啊！新年愿望我知道了！希望有一天斯露德可以自由地在天空下歌唱！”\n临时“希望真的会有那么一天吧，虽然现在只是虚妄。”\n“一定会的！”"},
    ["200800102"]={id=200800102,wandName="虚临时妄",wandWeight="2.33kg",wandPlace="R-A.t1矿临时坑",wandFeatures="基临时于训练使用式杖设计，适用于全能型斯露德",wandMaterial="改临时良伴合金",wandRrait="坚固临时式杖",wandDes="夏洛临时临时临时使用源临时能极其特殊，这种操作方临时式很少见到，能够极大程度的控制源能汇聚临时成特殊的形态，这种操作方式往往需要长期的训练才能学会如此精妙地操作方式，当前对于式杖的设计只能尽可能的辅临时助夏洛完成这种操作。\n——REVO.Y",wandText="夏洛临时临时临时曾经做了一个梦，她临时梦见自己盛装打扮临时，站在座无虚席的舞台中央尽情地歌唱，舞台下的人们都在认真地欣赏她的演出，天空之中没有异生体的侵袭，她自由自在地歌唱。\n人们幸福地听着她唱的歌曲，没有咒骂，没有责备，没有恐惧。\n然后夏洛将这个梦讲给了她的妹妹临时。\n\n“真的会有那样的一天吗？美好的甚至不像是梦境了。”\n“是真的很美好呀！啊！新年愿望我知道了！希望有一天斯露德可以自由地在天空下歌唱！”\n临时“希望真的会有那么一天吧，虽然现在只是虚妄。”\n“一定会的！”"},
    ["200900102"]={id=200900102,wandName="虚临时妄",wandWeight="2.33kg",wandPlace="R-A.t1矿临时坑",wandFeatures="基临时于训练使用式杖设计，适用于全能型斯露德",wandMaterial="改临时良伴合金",wandRrait="坚固临时式杖",wandDes="夏洛临时临时临时使用源临时能极其特殊，这种操作方临时式很少见到，能够极大程度的控制源能汇聚临时成特殊的形态，这种操作方式往往需要长期的训练才能学会如此精妙地操作方式，当前对于式杖的设计只能尽可能的辅临时助夏洛完成这种操作。\n——REVO.Y",wandText="夏洛临时临时临时曾经做了一个梦，她临时梦见自己盛装打扮临时，站在座无虚席的舞台中央尽情地歌唱，舞台下的人们都在认真地欣赏她的演出，天空之中没有异生体的侵袭，她自由自在地歌唱。\n人们幸福地听着她唱的歌曲，没有咒骂，没有责备，没有恐惧。\n然后夏洛将这个梦讲给了她的妹妹临时。\n\n“真的会有那样的一天吗？美好的甚至不像是梦境了。”\n“是真的很美好呀！啊！新年愿望我知道了！希望有一天斯露德可以自由地在天空下歌唱！”\n临时“希望真的会有那么一天吧，虽然现在只是虚妄。”\n“一定会的！”"},
}
--生成获取数据的方法
---@return LeaderBookWand
function GetLeaderBookWandData(id)
    return LeaderBookWand_Xls[tostring(id)]
end
--自动生成注释
---@class LeaderBookWand : table 
---@field id number
---@field wandName string
---@field wandWeight string
---@field wandPlace string
---@field wandFeatures string
---@field wandMaterial string
---@field wandRrait string
---@field wandDes string
---@field wandText string
