local default = {id=0,imageNames=xlsNilTable}
local mt = {}
mt.__index = function(table, key)
    local val = rawget(table, key)
    if val then
        return val
    else
        return default[key]
    end
end
---@class WorldMapImages_Xls : table 
WorldMapImages_Xls =
{
    ["1"]=setmetatable({id=1,imageNames={[1]="a_01",[2]="a_02",[3]="a_03",[4]="a_04",[5]="a_05",[6]="a_06",[7]="a_07",[8]="a_08",[9]="a_09",[10]="a_10",[11]="a_11",[12]="a_12",[13]="a_13",[14]="a_14"}},mt),
    ["2"]=setmetatable({id=2,imageNames={[1]="b_01",[2]="b_02",[3]="b_03",[4]="b_04",[5]="b_05",[6]="b_06",[7]="b_07",[8]="b_08",[9]="b_09",[10]="b_10",[11]="b_11",[12]="b_12",[13]="b_13",[14]="b_14"}},mt),
    ["3"]=setmetatable({id=3,imageNames={[1]="c_01",[2]="c_02",[3]="c_03",[4]="c_04",[5]="c_05",[6]="c_06",[7]="c_07",[8]="c_08",[9]="c_09",[10]="c_10",[11]="c_11",[12]="c_12",[13]="c_13",[14]="c_14"}},mt),
    ["4"]=setmetatable({id=4,imageNames={[1]="d_01",[2]="d_02",[3]="d_03",[4]="d_04",[5]="d_05",[6]="d_06",[7]="d_07",[8]="d_08",[9]="d_09",[10]="d_10",[11]="d_11",[12]="d_12",[13]="d_13",[14]="d_14"}},mt),
    ["5"]=setmetatable({id=5,imageNames={[1]="e_01",[2]="e_02",[3]="e_03",[4]="e_04",[5]="e_05",[6]="e_06",[7]="e_07",[8]="e_08",[9]="e_09",[10]="e_10",[11]="e_11",[12]="e_12",[13]="e_13",[14]="e_14"}},mt),
    ["6"]=setmetatable({id=6,imageNames={[1]="f_01",[2]="f_02",[3]="f_03",[4]="f_04",[5]="f_05",[6]="f_06",[7]="f_07",[8]="f_08",[9]="f_09",[10]="f_10",[11]="f_11",[12]="f_12",[13]="f_13",[14]="f_14"}},mt),
    ["7"]=setmetatable({id=7,imageNames={[1]="g_01",[2]="g_02",[3]="g_03",[4]="g_04",[5]="g_05",[6]="g_06",[7]="g_07",[8]="g_08",[9]="g_09",[10]="g_10",[11]="g_11",[12]="g_12",[13]="g_13",[14]="g_14"}},mt),
    ["8"]=setmetatable({id=8,imageNames={[1]="h_01",[2]="h_02",[3]="h_03",[4]="h_04",[5]="h_05",[6]="h_06",[7]="h_07",[8]="h_08",[9]="h_09",[10]="h_10",[11]="h_11",[12]="h_12",[13]="h_13",[14]="h_14"}},mt),
    ["9"]=setmetatable({id=9,imageNames={[1]="i_01",[2]="i_02",[3]="i_03",[4]="i_04",[5]="i_05",[6]="i_06",[7]="i_07",[8]="i_08",[9]="i_09",[10]="i_10",[11]="i_11",[12]="i_12",[13]="i_13",[14]="i_14"}},mt),
    ["10"]=setmetatable({id=10,imageNames={[1]="j_01",[2]="j_02",[3]="j_03",[4]="j_04",[5]="j_05",[6]="j_06",[7]="j_07",[8]="j_08",[9]="j_09",[10]="j_10",[11]="j_11",[12]="j_12",[13]="j_13",[14]="j_14"}},mt),
}
--生成获取数据的方法
---@return WorldMapImages
function GetWorldMapImagesData(id)
    return WorldMapImages_Xls[tostring(id)]
end
--自动生成注释
---@class WorldMapImages : table 
---@field id number
---@field imageNames table
